{
  "templates": [
    {
      "name": "Get Top News Headlines",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/top_headlines.png?raw=true",
      "description": "Generates a comprehensive daily news intelligence briefing with analysis, categorization, and professional formatting for a specific country.",
      "tags": [
        "News"
      ],
      "goal": "Fetch the top 10 current news headlines from Google News for the '{{ variables['Country'] }}' region. Analyze and categorize the headlines by topic (Politics, Business, Technology, Health, Sports, etc.). Create a professional news briefing document that includes: 1) Executive summary of key trends, 2) Detailed breakdown of each headline with source and timestamp, 3) Regional impact analysis, and 4) Key takeaways for the day. Format this comprehensive briefing into a well-structured email with the subject 'Daily News Intelligence Briefing - {{ variables['Country'] }}' and send it to me via email.",
      "variable_names": [
        "Country"
      ],
      "required_app_names": [
        "GOOGLE_NEWS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Comprehensive Stock Analysis Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/stock_report.jpeg?raw=true",
      "description": "Generates an institutional-grade investment research report with comprehensive financial, technical, and sentiment analysis for informed decision-making.",
      "tags": [
        "Finance"
      ],
      "goal": "For the stock ticker '{{ variables['Stock Ticker'] }}', create a comprehensive institutional-grade investment research report. SECTION 1 - Company Overview: Retrieve detailed company information including business description, sector analysis, market capitalization, employee count, and key executives. SECTION 2 - Financial Analysis: Gather fundamental metrics including P/E ratio, revenue growth, profit margins, debt-to-equity ratio, and quarterly earnings trends. SECTION 3 - Technical Analysis: Fetch 2-year historical price data, calculate moving averages (50-day, 200-day), identify support/resistance levels, and analyze volume patterns. SECTION 4 - Market Sentiment: Collect the latest 20 news articles about the company, perform sentiment analysis, and identify key themes affecting stock performance. SECTION 5 - Search Trends: Analyze Google search interest over the past 12 months to gauge public interest and correlation with stock movements. SECTION 6 - Investment Thesis: Synthesize all data into actionable insights including risk assessment, growth prospects, competitive positioning, and recommendation framework. Format this as a professional PDF report with charts, graphs, and executive summary suitable for investment decision-making.",
      "variable_names": [
        "Stock Ticker"
      ],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_TRENDS",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Domain DNS Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/dns_report.jpeg?raw=true",
      "description": "Performs a comprehensive DNS security audit with vulnerability assessment, compliance checking, and professional reporting.",
      "tags": [
        "Security"
      ],
      "goal": "Perform a comprehensive DNS security audit for the domain '{{ variables['Domain Name'] }}'. Conduct multiple DNS record lookups including A, AAAA, MX, TXT, NS, CNAME, and SOA records. Analyze the results for security vulnerabilities, misconfigurations, and best practices compliance. Check for SPF, DKIM, and DMARC email authentication records. Verify SSL certificate status and expiration dates. Assess subdomain enumeration and potential exposure risks. Compile findings into a professional cybersecurity assessment report with risk ratings, remediation recommendations, and compliance status. Send the detailed DNS Security Audit Report via email with the subject 'Professional DNS Security Assessment - {{ variables['Domain Name'] }}'.",
      "variable_names": [
        "Domain Name"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Wikipedia Article to DOCX",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/wikipedia_summary.jpeg?raw=true",
      "description": "Creates a comprehensive multi-page research report from Wikipedia content with professional formatting, cross-references, and detailed analysis.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive research document for the topic '{{ variables['Topic'] }}' using Wikipedia as the primary source. PHASE 1 - Data Collection: Retrieve the full Wikipedia article content, including main sections, subsections, references, and related articles. Extract key facts, dates, statistics, and notable information. PHASE 2 - Content Enhancement: Expand the summary by researching related Wikipedia pages and cross-referencing information to provide context and depth. Include historical background, current relevance, key figures, and significant developments. PHASE 3 - Document Creation: Structure the content into a professional Microsoft Word document with the following sections: Executive Summary, Detailed Overview, Historical Context, Key Facts & Statistics, Notable Figures/Events, Current Relevance, References, and Further Reading. PHASE 4 - Formatting: Apply professional formatting including proper headings, bullet points, tables for data, and consistent styling. The document should be 3-5 pages long with comprehensive coverage. Save as '{{ variables['Topic'] }}_Comprehensive_Research_Report.docx'. Notify me using push notification when the document is ready.",
      "variable_names": [
        "Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Market Summary Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/market_summary.jpeg?raw=true",
      "description": "Creates a comprehensive daily financial market overview with stock performance, news analysis, and trend insights.",
      "tags": [
        "Finance"
      ],
      "goal": "Generate a comprehensive daily market summary report for today. PHASE 1 - Market Overview: Retrieve current market indices performance (S&P 500, NASDAQ, Dow Jones) and major stock movements. PHASE 2 - Top Movers: Identify and analyze the biggest gainers and losers of the day with percentage changes. PHASE 3 - News Analysis: Collect top financial news stories and analyze their potential market impact. PHASE 4 - Professional Report: Create a formatted document with market summary, key insights, and outlook. PHASE 5 - Distribution: Send the daily market report with subject 'Daily Market Intelligence Report - [Current Date]'.",
      "variable_names": [],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_NEWS",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    },
    {
      "name": "Topic Research Compilation",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/topic_research.jpeg?raw=true",
      "description": "Researches any topic across multiple sources and creates a comprehensive research document with citations.",
      "tags": [
        "Research"
      ],
      "goal": "Conduct comprehensive research on '{{ variables['Research Topic'] }}' and compile findings into a professional document. PHASE 1 - Wikipedia Research: Gather detailed information from Wikipedia including historical context, key facts, and current relevance. PHASE 2 - News Analysis: Collect recent news articles and developments related to the topic. PHASE 3 - Document Creation: Structure all findings into a comprehensive research report with sections for overview, current developments, and key insights. PHASE 4 - Delivery: Send the research compilation with subject 'Research Report: {{ variables['Research Topic'] }}'.",
      "variable_names": [
        "Research Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "GOOGLE_NEWS",
        "DOCX_TOOLS",
        "SEARXNG"
      ],
      "is_deep": true
    },
    {
      "name": "Survey Creation & Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/survey_creation.png?raw=true",
      "description": "Creates professional surveys and sets them up for data collection with sharing information.",
      "tags": [
        "Surveys"
      ],
      "goal": "Create a professional survey for '{{ variables['Survey Topic'] }}' and prepare it for distribution. STEP 1 - Create Survey: Use TYPEFORM__CREATE_FORM to create a new form with title 'Survey: {{ variables['Survey Topic'] }}'. STEP 2 - Add Questions: Use TYPEFORM__UPDATE_FORM_STRUCTURE to add 5-7 relevant questions including: 1) multiple_choice question about main topic areas, 2) rating question (1-10 scale) for satisfaction/agreement, 3) short_text question for specific feedback, 4) long_text question for detailed comments, 5) yes_no question for follow-up interest. STEP 3 - Prepare Distribution: Use TYPEFORM__LIST_FORMS to get the form details and sharing URL. STEP 4 - Send Setup Confirmation: Use NOTIFYME to send survey creation confirmation with form URL, question summary, and instructions for sharing with target audience.",
      "variable_names": [
        "Survey Topic"
      ],
      "required_app_names": [
        "TYPEFORM"
      ],
      "is_deep": false
    },
    {
      "name": "Water Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/water_reminder.jpeg?raw=true",
      "description": "Sends a friendly reminder to drink water and stay hydrated.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a hydration reminder via mobile push notification: 'Time to hydrate! 💧 Drink a glass of water to stay healthy and energized. Your body needs regular hydration to function at its best.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with an encouraging message about hydration benefits.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Take a Break Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/take_a_break.jpeg?raw=true",
      "description": "Reminds you to take a break from work or screen time for better productivity.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send an encouraging break reminder via mobile push notification: 'Time for a quick break! 🧘 Stand up, stretch, or step away from your screen for 5 minutes. Taking regular breaks helps maintain focus and prevents eye strain.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with suggestions for break activities.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Gratitude Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/daily_gratitude.jpeg?raw=true",
      "description": "Sends a daily prompt to practice gratitude and positive thinking.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a gratitude reminder via mobile push notification: 'What are you grateful for today? ✨ Take a moment to appreciate three good things that happened. Practicing gratitude helps improve mental wellness and cultivate a positive mindset.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with mindfulness prompts.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Exercise Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/excersise_reminder.jpeg?raw=true",
      "description": "Motivational reminder to stay active and maintain fitness goals.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a motivational fitness reminder via mobile push notification: 'Time to move your body! 💪 Even 10 minutes of activity makes a difference. Whether it's a quick walk, some stretches, or a full workout, your body will thank you.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with encouraging fitness motivation.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Medication Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/medication_reminder.jpeg?raw=true",
      "description": "Important health reminder to take medication or supplements.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a critical medication reminder via mobile push notification for '{{ variables['Medication Name'] }}': '⚕️ MEDICATION REMINDER: Time to take your {{ variables['Medication Name'] }}. Don't skip your dose! Consistent medication adherence is important for your health.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION for immediate attention.",
      "variable_names": [
        "Medication Name"
      ],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Goal Check-in",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/productivity_goal.jpeg?raw=true",
      "description": "Prompt to review progress on daily goals and tasks.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a goal check-in prompt via mobile push notification: 'How are your goals coming along today? 🎯 Take a moment to review your progress and plan your next steps. Small daily actions lead to big achievements!' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with motivational productivity messages.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Posture Check Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/posture_check.jpeg?raw=true",
      "description": "Reminder to maintain good posture while working or sitting.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a posture awareness reminder via mobile push notification: 'Posture check! 🪑 Sit up straight, relax your shoulders, and adjust your screen height. Good posture prevents back pain and helps you stay comfortable during work.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with ergonomic health tips.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Custom Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/custom_reminder.jpeg?raw=true",
      "description": "Creates a personalized reminder for anything you want to remember.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a custom reminder about '{{ variables['Reminder Topic'] }}' via mobile push notification with the message: '{{ variables['Reminder Message'] }}' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with the custom title and message, including encouraging words and relevant tips for consistency.",
      "variable_names": [
        "Reminder Topic",
        "Reminder Message"
      ],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Weekly Team Progress Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/jira_team_report.jpeg?raw=true",
      "description": "Generates a comprehensive weekly team progress report from JIRA with project status, issue summaries, and team performance insights.",
      "tags": [
        "Productivity"
      ],
      "goal": "Generate a comprehensive weekly team progress report from JIRA for '{{ variables['Project Key'] }}'. STEP 1 - Setup: Use JIRA__GET_ACCESSIBLE_RESOURCES to get the cloud ID, then JIRA__GET_PROJECTS to verify project access. STEP 2 - Collect Data: Use JIRA__SEARCH_ISSUES with JQL queries to gather: a) Issues completed this week (status changed to Done), b) Issues currently in progress, c) High priority issues, d) Issues assigned to each team member. STEP 3 - Analyze Metrics: Calculate completion rates, identify blockers, track sprint progress, and summarize team workload distribution. STEP 4 - Generate Report: Create a structured document with executive summary, team achievements, current focus areas, upcoming deadlines, and key metrics. STEP 5 - Distribute: Send via email with subject 'Weekly Team Progress Report - {{ variables['Project Key'] }} - [Current Date]' including charts and actionable insights for stakeholders.",
      "variable_names": [
        "Project Key"
      ],
      "required_app_names": [
        "JIRA",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Website Monitor & Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/website_monitor.jpeg?raw=true",
      "description": "Monitors website availability and performance with instant alerts when issues are detected.",
      "tags": [
        "Monitoring"
      ],
      "goal": "Monitor the website '{{ variables['Website URL'] }}' for availability and performance issues. Use IP_TOOLS functions to perform regular health checks including: 1) HTTP response status verification, 2) Response time measurement, 3) SSL certificate validation, 4) DNS resolution checks. If any issues are detected (site down, slow response >5 seconds, SSL expiring within 30 days), immediately send alert via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with specific details about the problem and recommended actions for quick resolution.",
      "variable_names": [
        "Website URL"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily arXiv Research Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/arxiv_digest.jpeg?raw=true",
      "description": "Curates and delivers a personalized daily digest of the latest research papers from arXiv based on your interests.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive daily arXiv research digest for '{{ variables['Research Field'] }}'. STEP 1 - Paper Collection: Use ARXIV to search for the latest papers in {{ variables['Research Field'] }} published in the last 24 hours, focusing on high-impact research with relevance scoring. STEP 2 - Content Analysis: For each paper, extract key information including title, authors, abstract summary, methodology highlights, and potential impact. Identify breakthrough findings, novel approaches, and significant contributions. STEP 3 - Digest Creation: Structure findings into a professional HTML email briefing with sections for: Featured Papers (top 3 most significant), Emerging Trends, Methodological Innovations, and Quick Reads (papers under 10 pages). STEP 4 - Intelligence Report: Format as a comprehensive email with paper summaries, author insights, citation potential, and relevance to current research landscape. STEP 5 - Delivery: Send the arXiv Research Digest via NOTIFYME__SEND_ME_EMAIL with subject 'Daily arXiv Research Digest - {{ variables['Research Field'] }} - [Current Date]' including direct links to papers and reading recommendations in a well-formatted HTML email.",
      "variable_names": [
        "Research Field"
      ],
      "required_app_names": [
        "ARXIV",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Hacker News Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/hackernews_digest.jpeg?raw=true",
      "description": "Delivers a curated daily summary of top stories, discussions, and tech trends from Hacker News with community insights.",
      "tags": [
        "News"
      ],
      "goal": "Generate a comprehensive daily Hacker News digest with the most engaging tech stories and discussions. STEP 1 - Story Collection: Use HACKERNEWS to fetch today's top stories, trending discussions, and highly-commented posts. Focus on stories with high engagement (upvotes + comments) and tech relevance. STEP 2 - Content Categorization: Organize stories into categories: Startup News, Technology Trends, Programming & Development, AI/ML Updates, Open Source Projects, Industry Analysis, and Community Discussions. STEP 3 - Engagement Analysis: For each top story, include upvote count, comment highlights, and community sentiment. Identify controversial topics and emerging debates. STEP 4 - Trend Identification: Analyze recurring themes, popular technologies mentioned, and emerging patterns in the tech community discourse. STEP 5 - Email Digest: Format as a comprehensive HTML email with executive summary of key tech trends, detailed story breakdowns with community insights, notable comments from experts, and clickable links for deeper reading. STEP 6 - Distribution: Send the Hacker News Tech Digest via NOTIFYME__SEND_ME_EMAIL with subject 'Daily Hacker News Tech Digest - [Current Date]' including story links and community discussion highlights in a well-structured HTML email format.",
      "variable_names": [],
      "required_app_names": [
        "HACKERNEWS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Joke Notification",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/daily_joke.jpeg?raw=true",
      "description": "Brightens your day with a funny joke delivered via mobile push notification.",
      "tags": [
        "Entertainment"
      ],
      "goal": "Fetch a random joke from JOKES_API and deliver it via mobile push notification. Use JOKES_API to get a clean, family-friendly joke. Keep the notification short. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Daily Joke 😄' and the joke content formatted concisely with emojis.",
      "variable_names": [],
      "required_app_names": [
        "JOKE_API",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "URL to PDF Converter",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/url_to_pdf.png?raw=true",
      "description": "Converts any web page or article to a clean, formatted PDF document for offline reading and archiving.",
      "tags": [
        "Productivity"
      ],
      "goal": "Convert the webpage at '{{ variables['Website URL'] }}' to PDF using PDF_TOOLS.",
      "variable_names": [
        "Website URL"
      ],
      "required_app_names": [
        "PDF_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Create Notion Meeting Notes From Todoist Tasks",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/todoist_notion_notes.jpeg?raw=true",
      "description": "When a Todoist task is marked as a meeting, create a Notion meeting notes page pre-populated with task details and attendees.",
      "tags": [
        "Productivity"
      ],
      "goal": "Monitor Todoist tasks labeled 'meeting' or moved into the project the user picks when enabling this automation. For each matching task, create a Notion page in the Notion database the user selects with title '{{ task.content }} - Meeting Notes' and include metadata (due date, priority, project) and a link back to the Todoist task. Optionally extract attendees from the task description. Send an optional confirmation notification with the Notion page link using NOTIFYME__SEND_ME_EMAIL or a mobile notification based on user preference. Do not create duplicate data.",
      "variable_names": [
        "Meeting Project Name",
        "Notion Database Name",
        "Send Confirmation Email (yes/no)"
      ],
      "required_app_names": [
        "TODOIST",
        "NOTION",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Todoist Summary",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/todoist_daily_digest.jpeg?raw=true",
      "description": "Sends a daily digest of your top Todoist tasks, overdue items, and upcoming tasks for the day.",
      "tags": [
        "Productivity"
      ],
      "goal": "Every morning, list incomplete Todoist tasks due today or overdue using TODOIST__LIST_TASKS (filter by due date). Summarize top 5 tasks and overdue count, then send a formatted email via NOTIFYME__SEND_ME_EMAIL with subject 'Your Todoist Summary - [Today]'. Optionally include quick links to mark tasks complete.",
      "variable_names": [],
      "required_app_names": [
        "TODOIST",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Work Schedule Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/work_schedule.jpeg?raw=true",
      "description": "Creates a professional work schedule in Cal.com with specified working hours and timezone for optimal meeting booking.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create work schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for Monday through Friday from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone",
        "Start Time",
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Weekend Availability Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/weekend_schedule.jpeg?raw=true",
      "description": "Sets up weekend availability in Cal.com for flexible meeting scheduling outside regular business hours.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create weekend schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for Saturday and Sunday from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone",
        "Start Time",
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Schedule Overview Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/schedule_report.jpeg?raw=true",
      "description": "Generates a comprehensive report of all your Cal.com schedules with availability details and settings.",
      "tags": [
        "Productivity"
      ],
      "goal": "Generate schedule overview report using CAL__GET_SCHEDULES to retrieve all schedules, then create professional summary document with DOCX_TOOLS showing schedule details and availability patterns.",
      "variable_names": [],
      "required_app_names": [
        "CAL",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    },
    {
      "name": "Custom Schedule Creator",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/custom_schedule.jpeg?raw=true",
      "description": "Creates a fully customized schedule in Cal.com with specific days, hours, and availability patterns tailored to your needs.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create custom schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for {{ variables['Available Days'] }} from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone",
        "Available Days",
        "Start Time",
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Schedule Backup & Documentation",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/schedule_backup.jpeg?raw=true",
      "description": "Creates a comprehensive backup and documentation of all your Cal.com schedules for safekeeping and reference.",
      "tags": [
        "Productivity"
      ],
      "goal": "Backup all Cal.com schedules using CAL__GET_SCHEDULES to retrieve schedule data, then create detailed backup document with DOCX_TOOLS containing all schedule configurations and settings.",
      "variable_names": [],
      "required_app_names": [
        "CAL",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Cricket Live Scores",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_live_scores.jpeg?raw=true",
      "description": "Delivers real-time cricket match updates and live scores directly to your mobile device throughout the day.",
      "tags": [
        "Sports"
      ],
      "goal": "Fetch live cricket matches and scores using CRICBUZZ__GET_LIVE_MATCHES. Format the results into an engaging summary including match status, current scores, key player performances, and match highlights. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Live Cricket Updates 🏏' and comprehensive score updates with team names, overs played, and match situation for immediate awareness of ongoing cricket action.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Cricket Schedule Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_schedule.jpeg?raw=true",
      "description": "Provides a comprehensive overview of upcoming international cricket matches with dates, venues, and series information.",
      "tags": [
        "Sports"
      ],
      "goal": "Generate upcoming cricket schedule using CRICBUZZ__GET_UPCOMING_SCHEDULE to get all upcoming international matches. Organize matches by series, format (Test/ODI/T20), and chronological order. Create a detailed schedule report with match dates, venues, team matchups, and series context. Format as a professional cricket calendar and send via NOTIFYME__SEND_ME_EMAIL with subject 'Upcoming Cricket Schedule Digest' including match timings and broadcasting information for comprehensive cricket planning.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Latest Cricket Squad Updates",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_squads.jpeg?raw=true",
      "description": "Gets the latest cricket team squad information and player updates from ongoing matches.",
      "tags": [
        "Sports"
      ],
      "goal": "Find current live matches using CRICBUZZ__GET_LIVE_MATCHES and get squad information using CRICBUZZ__GET_SQUADS for the most recent match. If no live matches, use SEARXNG to search for 'latest cricket squad announcements' as backup. Create a summary of team selections, key players, and any squad changes. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Cricket Squad Update 🏏' and player lineup information.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Latest Match Scorecard",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_scorecard.jpeg?raw=true",
      "description": "Gets the latest completed cricket match scorecard with player performances and match highlights.",
      "tags": [
        "Sports"
      ],
      "goal": "Find recent matches using CRICBUZZ__GET_LIVE_MATCHES and get detailed scorecard using CRICBUZZ__GET_FULL_SCORECARD for the most recent completed match. If no recent matches found, use SEARXNG to search for 'latest cricket match results scorecard' as backup. Extract batting and bowling statistics, key performances, and match highlights. Send comprehensive scorecard summary via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Latest Cricket Scorecard 🏏' including top performers and match result.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Cricket News Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_news.jpeg?raw=true",
      "description": "Delivers a comprehensive daily cricket update combining live matches, news, and upcoming fixtures.",
      "tags": [
        "Sports"
      ],
      "goal": "Create daily cricket briefing combining live matches from CRICBUZZ__GET_LIVE_MATCHES, upcoming schedule from CRICBUZZ__GET_UPCOMING_SCHEDULE, and latest cricket news using SEARXNG search for 'cricket news today'. Analyze current match situations, breaking news, player updates, and upcoming fixtures. Format as comprehensive cricket digest and send via NOTIFYME__SEND_ME_EMAIL with subject 'Daily Cricket Digest' including live scores, news highlights, and schedule updates for complete cricket awareness.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Next Cricket Match Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_reminder.jpeg?raw=true",
      "description": "Sends alerts about the next upcoming international cricket match with match details.",
      "tags": [
        "Sports"
      ],
      "goal": "Get the next upcoming international match using CRICBUZZ__GET_UPCOMING_SCHEDULE. If no matches found, use SEARXNG to search for 'next international cricket match' as backup. Create alert about the upcoming match including teams, format, venue, and start time. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Next Cricket Match 🏏' and message containing match details with teams, format, and timing. Include series context for engaging cricket alerts.",
      "variable_names": [],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "My Team Cricket Updates",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/cricket_team_updates.jpeg?raw=true",
      "description": "Get personalized updates for your favorite cricket team including matches, news, and player information.",
      "tags": [
        "Sports"
      ],
      "goal": "Search for matches involving '{{ variables['Favorite Team'] }}' using CRICBUZZ__GET_UPCOMING_SCHEDULE and CRICBUZZ__GET_LIVE_MATCHES. Also search for team-specific news using SEARXNG with query '{{ variables['Favorite Team'] }} cricket news latest'. Compile comprehensive team update including upcoming matches, current match status if playing, recent news, and key player updates. Send personalized team digest via NOTIFYME__SEND_ME_EMAIL with subject '{{ variables['Favorite Team'] }} Cricket Update' including match schedules, live scores, and breaking news about your team.",
      "variable_names": [
        "Favorite Team"
      ],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Team Match Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/team_match_reminder.jpeg?raw=true",
      "description": "Get reminded about your favorite team's upcoming matches so you never miss a game.",
      "tags": [
        "Sports"
      ],
      "goal": "Find upcoming matches for '{{ variables['Team Name'] }}' using CRICBUZZ__GET_UPCOMING_SCHEDULE. Search through the schedule to identify matches where {{ variables['Team Name'] }} is playing. If no matches found in Cricbuzz, use SEARXNG to search for '{{ variables['Team Name'] }} next cricket match' as backup. Create personalized match reminder with opponent, match format, venue, date and time. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title '{{ variables['Team Name'] }} Match Alert 🏏' and message containing next match details, countdown, and viewing information.",
      "variable_names": [
        "Team Name"
      ],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Favorite Team Live Score",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/team_live_score.jpeg?raw=true",
      "description": "Get live score updates specifically for your favorite team when they're playing.",
      "tags": [
        "Sports"
      ],
      "goal": "Check if '{{ variables['Favorite Team'] }}' is currently playing using CRICBUZZ__GET_LIVE_MATCHES. Filter live matches to find games involving {{ variables['Favorite Team'] }}. If team is playing, get detailed match information and current score. If not currently playing, use SEARXNG to search for '{{ variables['Favorite Team'] }} latest match result' for recent performance. Send focused team update via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title '{{ variables['Favorite Team'] }} Live Update 🏏' including current score, match situation, key performances, and match status specifically for your team.",
      "variable_names": [
        "Favorite Team"
      ],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Team Performance Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/team_performance.jpeg?raw=true",
      "description": "Comprehensive performance analysis of your favorite cricket team with recent matches and statistics.",
      "tags": [
        "Sports"
      ],
      "goal": "Generate detailed performance report for '{{ variables['Team Name'] }}' by searching recent matches in CRICBUZZ__GET_UPCOMING_SCHEDULE and checking current status in CRICBUZZ__GET_LIVE_MATCHES. Use SEARXNG to search for '{{ variables['Team Name'] }} cricket recent performance statistics' to get additional context. Analyze recent form, key player performances, win-loss record, and upcoming challenges. Create comprehensive team report using DOCX_TOOLS with sections for: Recent Match Results, Key Player Stats, Team Strengths/Weaknesses, Upcoming Fixtures, and Performance Trends. Send detailed analysis via NOTIFYME__SEND_ME_EMAIL with subject '{{ variables['Team Name'] }} Performance Report' including statistical insights and team outlook.",
      "variable_names": [
        "Team Name"
      ],
      "required_app_names": [
        "CRICBUZZ",
        "SEARXNG",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily YouTube Video Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/youtube_digest.jpeg?raw=true",
      "description": "Creates a personalized daily digest of trending YouTube videos based on your interests with video details and summaries.",
      "tags": [
        "YouTube",
        "Video",
        "Entertainment"
      ],
      "goal": "Create a personalized YouTube video digest for '{{ variables['Topic'] }}'. STEP 1 - Search Videos: Use YOUTUBE_UNOFFICIAL__SEARCH_VIDEOS to find the latest and most relevant videos about {{ variables['Topic'] }} with max_results set to 10. STEP 2 - Get Details: For each video, use YOUTUBE_UNOFFICIAL__GET_VIDEO_DETAILS to fetch comprehensive information including title, author, views, duration, and upload date. STEP 3 - Content Analysis: Analyze video metadata to identify trending content, popular channels, and emerging topics. STEP 4 - Digest Creation: Structure findings into a professional HTML email briefing with sections for: Top Videos, Trending Channels, Content Highlights, and Viewing Recommendations. STEP 5 - Delivery: Send the YouTube Video Digest via NOTIFYME__SEND_ME_EMAIL with subject 'Daily YouTube Digest - {{ variables['Topic'] }} - [Current Date]' including video thumbnails, direct links, and engagement metrics in a well-formatted HTML email.",
      "variable_names": [
        "Topic"
      ],
      "required_app_names": [
        "YOUTUBE_UNOFFICIAL",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "YouTube Video Recommendations",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/youtube_recommendations.jpeg?raw=true",
      "description": "Gets personalized YouTube video recommendations based on topics, channels, or viewing patterns.",
      "tags": [
        "YouTube"
      ],
      "goal": "Generate personalized YouTube video recommendations based on '{{ variables['Interest Topic'] }}'. STEP 1 - Search Content: Use YOUTUBE_UNOFFICIAL__SEARCH_VIDEOS to find high-quality videos related to {{ variables['Interest Topic'] }} with diverse perspectives and content types. STEP 2 - Content Curation: Filter and curate videos based on engagement metrics, channel credibility, and content relevance. STEP 3 - Channel Discovery: Identify promising channels and creators in the topic area using channel information from video results. STEP 4 - Recommendation Engine: Create personalized recommendations considering factors like view count, upload date, and content diversity. STEP 5 - Curated List: Compile top 15-20 video recommendations with detailed descriptions, why they're recommended, and estimated watch time. STEP 6 - Delivery: Send personalized recommendations via NOTIFYME__SEND_ME_EMAIL with subject 'YouTube Recommendations - {{ variables['Interest Topic'] }}' including video thumbnails, channel info, and viewing suggestions organized by content type and difficulty level.",
      "variable_names": [
        "Interest Topic"
      ],
      "required_app_names": [
        "YOUTUBE_UNOFFICIAL",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "YouTube Trending Topics Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/youtube_trending.jpeg?raw=true",
      "description": "Monitors trending YouTube topics and sends instant alerts about viral content and emerging trends.",
      "tags": [
        "YouTube"
      ],
      "goal": "Monitor trending YouTube topics and content for real-time viral alerts. STEP 1 - Trend Discovery: Use YOUTUBE_UNOFFICIAL__SEARCH_VIDEOS with trending parameters to identify currently popular videos and topics. STEP 2 - Viral Detection: Analyze view velocity, comment engagement, and sharing patterns to identify truly viral content. STEP 3 - Category Analysis: Categorize trending content by topic areas (entertainment, technology, news, gaming, etc.) to understand trend patterns. STEP 4 - Instant Alerts: Send immediate notifications via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION for videos reaching viral thresholds with title 'Viral YouTube Alert 🔥' including view count, trend category, and direct link. STEP 5 - Daily Summary: Send comprehensive trending report via NOTIFYME__SEND_ME_EMAIL with subject 'Daily YouTube Trends Report' including top trending videos, emerging topics, and trend analysis insights.",
      "variable_names": [],
      "required_app_names": [
        "YOUTUBE_UNOFFICIAL",
        "NOTIFYME",
        "GOOGLE_TRENDS"
      ],
      "is_deep": true
    },
    {
      "name": "YouTube Video Summarizer",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/youtube_video_summarizer.jpeg?raw=true",
      "description": "Automatically generates comprehensive summaries of YouTube videos using their transcripts, including key points, timestamps, and insights.",
      "tags": [
        "YouTube"
      ],
      "goal": "Create a comprehensive summary of the YouTube video '{{ variables['Video URL'] }}'. STEP 1 - Extract Transcript: Use YOUTUBE_UNOFFICIAL__GET_VIDEO_TRANSCRIPT to fetch the video's transcript/captions in the specified language. STEP 2 - Get Video Details: Use YOUTUBE_UNOFFICIAL__GET_VIDEO_DETAILS to retrieve video metadata including title, author, duration, and view count. STEP 3 - Content Analysis: Analyze the transcript to identify key topics, main arguments, and important insights discussed in the video. STEP 4 - Generate Summary: Create a structured summary including: Executive Summary (2-3 sentences), Key Points (bullet points), Important Timestamps (with time markers), Main Takeaways, and Related Topics. STEP 5 - Professional Report: Format the analysis into a comprehensive document using DOCX_TOOLS with sections for video overview, detailed summary, key insights, and actionable takeaways. STEP 6 - Distribution: Send the video summary via NOTIFYME__SEND_ME_EMAIL with subject 'YouTube Video Summary - {{ variables['Video Title'] }}' including the complete analysis, transcript highlights, and key timestamps for easy reference.",
      "variable_names": [
        "Video URL",
        "Video Title"
      ],
      "required_app_names": [
        "YOUTUBE_UNOFFICIAL",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Create Todoist Task From GitHub Assignment",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/github_to_todoist.jpeg?raw=true",
      "description": "When a GitHub issue is assigned to you, create a corresponding Todoist task so work is visible in your task list.",
      "tags": [
        "Productivity"
      ],
      "goal": "Monitor the user's GitHub repositories for issues assigned to them. When an issue is assigned, create a Todoist task in the project the user selects with content '{{ variables['Task Prefix'] }}: {{ issue.title }}' and include a link to the GitHub issue in the task notes. Notify the user via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION that a task was created. Make sure you do not duplicate tasks for the same issue. Do not create duplicates.",
      "variable_names": [
        "GitHub Repo",
        "Todoist Project Name",
        "Task Prefix"
      ],
      "required_app_names": [
        "GITHUB",
        "TODOIST",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Create Todoist Tasks From GitHub Milestone",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/milestone_to_tasks.jpeg?raw=true",
      "description": "Create Todoist tasks for each open issue in a GitHub milestone to track milestone work in your task list.",
      "tags": [
        "Productivity",
        "Developer Tools"
      ],
      "goal": "When the user selects a GitHub repo and milestone title, generate Todoist tasks for each open issue in that milestone in the Todoist project the user selects. Include issue title and link in each task and send a completion notification via NOTIFYME__SEND_ME_EMAIL when the import finishes.",
      "variable_names": [
        "GitHub Repo",
        "Milestone Title",
        "Todoist Project Name"
      ],
      "required_app_names": [
        "GITHUB",
        "TODOIST",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Tanki Online News Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/tanki-news.png?raw=true",
      "description": "Creates a daily digest of the latest Tanki Online game news and updates, summarizing the top stories for players.",
      "tags": [
        "Gaming"
      ],
      "goal": "Visit https://tankionline.com/en/news/ and extract the top 3 latest news articles. For each news item, gather the title, publication date, and a brief summary of the content. Create a comprehensive digest that includes: 1) Overview of current game updates and events, 2) Detailed summaries of each of the top 3 news items with key highlights, 3) Any upcoming events or important announcements. Format this as an engaging email digest and send it to the user via NOTIFYME__SEND_ME_EMAIL with subject 'Daily Tanki Online News Digest - [Current Date]' including game update highlights and player-relevant information.",
      "variable_names": [],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Tanki Online Weekly Patch Update",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/tanki-patch.png?raw=true",
      "description": "Checks the Tanki Online forums for the latest patch updates from this week and sends a comprehensive summary of new features, changes, and fixes.",
      "tags": [
        "Gaming"
      ],
      "goal": "Visit https://en.tankiforum.com/search/?&q=patch%20update&type=forums_topic&quick=1&nodes=118&start_after=week&sortby=relevancy to find the latest patch update threads from this week. Extract the most recent patch update post including: 1) Patch version number and release date, 2) Major new features and additions, 3) Balance changes and gameplay modifications, 4) Bug fixes and technical improvements, 5) Known issues and upcoming fixes. Create a comprehensive summary highlighting the most important changes for players. Send the patch update summary via NOTIFYME__SEND_ME_EMAIL with subject 'Tanki Online Weekly Patch Update - [Current Date]' including detailed breakdown of all changes and player impact assessment.",
      "variable_names": [],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Amazon Price Drop Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/amazon_price_alert.png?raw=true",
      "description": "Monitor an Amazon product price and get notified when it drops below your target price",
      "tags": [
        "Shopping"
      ],
      "goal": "You are monitoring an Amazon product for price drops. The product URL is '{{ variables['Product URL'] }}' and the target price is '{{ variables['Target Price'] }}'. Use the BROWSER app to visit the Amazon product page, extract the current price (look for the main price element, usually in the product details section), and compare it to the target price. If the current price is below the target, use the NOTIFYME app to send an immediate email notification and mobile notification, with the product name, current price, URL, and savings amount. If the price is not below target, do nothing. Log the current price for tracking. Run this check daily.",
      "variable_names": [
        "Product URL",
        "Target Price"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daraz Price Drop Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/daraz_price_alert.jpg?raw=true",
      "description": "Monitor a Daraz.pk product price and get notified when it drops below your target price",
      "tags": [
        "Shopping"
      ],
      "goal": "You are monitoring a Daraz.pk product for price drops. The product URL is '{{ variables['Product URL'] }}' and the target price is '{{ variables['Target Price'] }}'. Use the BROWSER app to visit the Daraz product page, extract the current price (look for the main price element, often displayed prominently near the title and marked with 'Rs.'), and compare it to the target price. If the current price is below the target, use the NOTIFYME app to send an immediate email notification and mobile notification, with the product name, current price, URL, and savings amount. If the price is not below target, do nothing. Log the current price for tracking. Run this check daily.",
      "variable_names": [
        "Product URL",
        "Target Price"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Noon Price Drop Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/noon_price_alert.jpg?raw=true",
      "description": "Monitor a Noon.com product price and get notified when it drops below your target price",
      "tags": [
        "Shopping"
      ],
      "goal": "You are monitoring a Noon.com product for price drops. The product URL is '{{ variables['Product URL'] }}' and the target price is '{{ variables['Target Price'] }}'. Use the BROWSER app to visit the Noon product page, extract the current price (look for the main price element, typically displayed in a large font and marked with the local currency like 'AED', 'SAR', or 'EGP'), and compare it to the target price. If the current price is below the target, use the NOTIFYME app to send an immediate email notification and mobile notification, with the product name, current price, URL, and savings amount. If the price is not below target, do nothing. Log the current price for tracking. Run this check daily.",
      "variable_names": [
        "Product URL",
        "Target Price"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Amazon Deals Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/amazon_deals_digest.png?raw=true",
      "description": "Get a daily digest of Amazon deals tailored to your chosen keywords or category.",
      "tags": [
        "Shopping"
      ],
      "goal": "You are fetching Amazon's deal page from 'https://www.amazon.com/gp/goldbox'. Search for deals that match the user's input keyword or category ('{{ variables['Deal Keyword'] }}'). From the matches, select the top 3–5 best deals based on highest discount and relevance. Collect the deal title, current price, original price, discount %, and link. Format them into a short digest-style summary and send email with the NOTIFYME app. If no relevant deals are found, send a brief email saying no new deals today.",
      "variable_names": [
        "Deal Keyword"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Air Quality Tracker",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/air_quality_tracker.jpeg?raw=true",
      "description": "Track your city’s air quality index (AQI) daily and get a digest of the latest status (Good, Moderate, Unhealthy, etc.).",
      "tags": [
        "Environment"
      ],
      "goal": "Go to https://aqicn.org/search/#q={{ variables['City Name'] }} and search for the city '{{ variables['City Name'] }}'. From the resulting page, extract the current AQI value and status label (e.g., 'Good', 'Moderate', 'Unhealthy'). Create a nicely formatted email with subject 'Daily Air Quality Report for {{ variables['City Name'] }}' and body including: a header with the city name, the AQI value prominently displayed, the status with appropriate color coding (green for Good, yellow for Moderate, red for Unhealthy), and a brief explanation of what the status means. If data cannot be retrieved, send an email with subject 'Air Quality Data Unavailable' and a polite message explaining the issue. Use the NOTIFYME app to send the daily email to the user.",
      "variable_names": [
        "City Name"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Weather Snapshot",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/weather_snapshot.png?raw=true",
      "description": "Get daily weather updates (temperature, condition, humidity) for your chosen city.",
      "tags": [
        "Environment"
      ],
      "goal": "Go to https://openweathermap.org/find?q={{ variables['City Name'] }}. From the resulting page, extract the city’s current temperature, weather condition (e.g., 'Sunny', 'Cloudy'), and humidity. Summarize the info'. Use the NOTIFYME app to send a daily email with this info and also send a short notification like 'Weather in X: Y°C, Z'. If data cannot be retrieved, notify the user that no weather data is available today.",
      "variable_names": [
        "City Name"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Earthquake Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/earthquake_alert.png?raw=true",
      "description": "Get daily earthquake updates for your chosen city and country.",
      "tags": [
        "Environment"
      ],
      "goal": "Go to https://earthquaketrack.com/search?q={{ variables['Country'] }},{{ variables['City'] }}. From the resulting page, extract the earthquakes reported in the last 24 hours, including magnitude, location, and time. Summarize in plain text: 'X earthquakes near City, Country in last 24h: [list]'. Use the NOTIFYME app to send a daily email with the summary and also a short notification like 'Latest quake near City: Mx.x at Time'. If data cannot be retrieved, notify the user that no earthquake data is available for today.",
      "variable_names": [
        "Country",
        "City"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Package Tracking Scraper",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/package_tracking.png?raw=true",
      "description": "Track your packages from USPS, FedEx, DHL, or DHL eCommerce using the tracking number without needing to log in.",
      "tags": [
        "Shopping"
      ],
      "goal": "Go to the public tracking page of the selected carrier using the tracking number {{ variables['Tracking Number'] }}. Supported carriers and their links: USPS - https://tools.usps.com/go/TrackConfirmAction_input?origTrackNum={{ variables['Tracking Number'] }}, FedEx - https://www.fedex.com/apps/fedextrack/?tracknumbers={{ variables['Tracking Number'] }}, DHL - https://www.dhl.com/global-en/home/tracking.html?tracking-id={{ variables['Tracking Number'] }}, DHL eCommerce - https://webtrack.dhlglobalmail.com/?trackingnumber={{ variables['Tracking Number'] }}. Extract the latest status, location, and expected delivery. Use the NOTIFYME app to send a notification with the latest update. If data cannot be retrieved, notify the user that tracking information is unavailable.",
      "variable_names": [
        "Tracking Number",
        "Carrier"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Is GTA 6 Out Yet?",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/gta6_release_checker.jpg?raw=true",
      "description": "Stop refreshing news sites. This automation constantly checks official sources to see if Grand Theft Auto VI has been released, and notifies you the moment it's out.",
      "tags": [
        "Gaming"
      ],
      "goal": "You are a highly anticipated game release monitor. Your sole mission is to determine if Grand Theft Auto VI has been officially released. Use the SEARXNG app for a two-step process. First, perform daily searches for queries like 'GTA 6 official release date' and 'Grand Theft Auto VI news Rockstar Games'. Prioritize and identify the URLs of top results ONLY from high-authority sources: the official Rockstar Games website, IGN, Kotaku, and GameSpot. Second, use the SEARXNG app again to directly read the HTML content of these trusted URLs. Analyze the content for keywords confirming an immediate release, such as 'out now', 'released today', or 'available worldwide'. If, and only if, a trusted source confirms the game is currently available for purchase or play, use the NOTIFYME app to send a single, high-priority email and mobile notification with the subject 'IT'S HAPPENING! GTA 6 IS OUT!'. Include the source URL in the notification body. If no definitive release confirmation is found, do nothing. This is the only notification this automation should ever send.",
      "variable_names": [],
      "required_app_names": [
        "SEARXNG",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Restock Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/generic_shopping_alert.png?raw=true",
      "description": "Monitor any product on almost any e-commerce site. Get an instant notification the moment an out-of-stock item is available to buy.",
      "tags": [
        "Shopping"
      ],
      "goal": "You are an expert e-commerce analyst. Your task is to determine the real-time stock status of a product on any given retail website using its URL. Use the BROWSER app to visit the provided 'Product URL' and analyze its content. Your primary focus is the main 'buy box' area, which is typically located near the product title, images, and price. First, search this main product area for explicit 'out of stock' indicators, such as the text 'Out of Stock', 'Sold Out', or 'Currently Unavailable'. Concurrently, search for an active, clickable button with text like 'Add to Cart' or 'Buy Now'. A button that is visible but disabled or greyed out must be treated as 'Out of Stock'. CRUCIALLY, you must IGNORE any mention of stock status found within user review sections, Q&A areas, or 'related products' carousels to avoid false positives. Maintain a memory of the item's last known status ('In Stock' or 'Out of Stock'). If the previous status was 'Out of Stock' and the current status is now definitively 'In Stock', you must use the NOTIFYME app to send a single, high-priority notification. The notification should say 'Restock Alert! The item is back in stock!' and include the Product URL. If the status has not changed, do nothing.",
      "variable_names": [
        "Product URL"
      ],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "NASA Astronomy Picture of the Day",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/nasa_apod.png?raw=true",
      "description": "Daily delivery of NASA's Astronomy Picture of the Day with image and explanation directly to your email.",
      "tags": [
        "Science"
      ],
      "goal": "First, use the HTTP_TOOLS app to fetch content from 'https://apod.nasa.gov/apod/astropix.html' and extract the clean text. From the fetched content, identify and extract the image URL (usually in an <img> tag or as a link to a high-resolution image). Look for patterns like 'image/XXXX/XXXX.jpg' or similar NASA image URLs. Next, use the IMAGE_TOOLS app to download the identified image URL and save it as an artifact. Finally, use the NOTIFYME app to send an email with the subject 'NASA APOD - [Current Date]'. The email should be concise and include: 1) The downloaded image as an attachment using the artifact ID, 2) Only the title from the NASA APOD page (keep it short), 3) A brief summary of the explanation (maximum 2-3 sentences), 4) A link to the full NASA APOD page for complete details. Keep the email content minimal and focused - avoid including the full explanation text to reduce email size. If any step fails, send a brief error notification.",
      "variable_names": [],
      "required_app_names": [
        "HTTP_TOOLS",
        "IMAGE_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "GitHub Trending Repositories",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/github_trending.png?raw=true",
      "description": "Daily digest of today's trending GitHub repositories with descriptions, stars, and programming languages.",
      "tags": [
        "Developer Tools",
        "Technology"
      ],
      "goal": "Use the BROWSER app to visit ONLY 'https://github.com/trending' - do NOT visit individual repository URLs one by one. Extract all the information directly from the trending page itself. From this single page, collect information about the top 10-15 repositories including: repository name, description, programming language, current star count, and GitHub URL (these URLs are visible on the trending page, just extract them without visiting). Organize this data into a clean, readable format and use the NOTIFYME app to send an email with the subject 'GitHub Trending Today - [Current Date]'. The email should include: 1) A brief introduction about trending repos, 2) A well-formatted list of repositories with name, language, stars, and short description for each, 3) GitHub URLs for each repository, 4) A footer encouraging exploration of interesting projects. Keep the email concise but informative, highlighting the most interesting repositories. IMPORTANT: Only visit the main trending page, do not navigate to individual repository pages.",
      "variable_names": [],
      "required_app_names": [
        "BROWSER",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Brainy Quote",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/brainy_quote.png?raw=true",
      "description": "Daily inspiration with a thought-provoking quote from BrainyQuote's Quote of the Day delivered to your mobile device.",
      "tags": [
        "Quotes"
      ],
      "goal": "Use the HTTP_TOOLS app to fetch content from 'https://www.brainyquote.com/quote_of_the_day' and extract the daily featured quote. From the fetched content, identify and extract the quote text and the author's name. Look for the main quote section which typically contains the quote text and attribution. Use the NOTIFYME app to send a mobile notification with the title 'Daily Brainy Quote 💭' and include the quote text followed by the author's name in a clean, readable format like: '[Quote text]' - Author Name. Keep the notification concise and inspiring. If the quote extraction fails, send a brief notification saying 'Quote of the day unavailable today' with an encouraging backup message.",
      "variable_names": [],
      "required_app_names": [
        "HTTP_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": false
    }
  ]
}