{
  "templates": [
    {
      "name": "Get Top News Headlines",
      "description": "Fetches the current top 5 news headlines for a specific country and sends them to you in an email.",
      "tags": [
        "News"
      ],
      "goal": "Fetch the top 5 news headlines from Google News for the '{{ variables['Country'] }}' region. Then, format these headlines into a clean summary and send it to me in an email with the subject 'Your Daily News Briefing'.",
      "variable_names": [
        "Country"
      ],
      "required_app_names": [
        "GOOGLE_NEWS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Comprehensive Stock Analysis Report",
      "description": "Generates a detailed report for a stock, including fundamental data, historical performance, search trends, and the latest news.",
      "tags": [
        "Finance"
      ],
      "goal": "For the stock ticker '{{ variables['Stock Ticker'] }}', create a comprehensive research report. For fundamental analysis, retrieve the company's key info like its business summary and market cap. For technical analysis, fetch the historical stock data for the past year. For market trends, get the latest company news and the Google search interest over the last 3 months. Finally, synthesize all of this information into a well-structured report.",
      "variable_names": [
        "Stock Ticker"
      ],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_TRENDS"
      ],
      "is_deep": false
    },
    {
      "name": "Domain DNS Report",
      "description": "Performs a DNS lookup for a domain to get key records and emails you the results.",
      "tags": [
        "Utilities"
      ],
      "goal": "Perform a DNS lookup for the domain '{{ variables['Domain Name'] }}' to get its 'A', 'MX', and 'TXT' records. Format the results into a clear report and send it to me in an email with the subject 'DNS Report for {{ variables['Domain Name'] }}'.",
      "variable_names": [
        "Domain Name"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Wikipedia Article to DOCX",
      "description": "Summarizes a Wikipedia article on any topic and saves the summary as a Microsoft Word document.",
      "tags": [
        "Research"
      ],
      "goal": "Get the summary of the Wikipedia article for the topic '{{ variables['Topic'] }}'. Then, take that summary content and convert it into a Microsoft Word document. The title of the document should be the topic itself. The output filename should also be based on the topic (e.g., 'Topic_Summary.docx'). Save the final file.",
      "variable_names": [
        "Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    }
  ]
}
