{
  "templates": [
    {
      "name": "Get Top News Headlines",
      "description": "Generates a comprehensive daily news intelligence briefing with analysis, categorization, and professional formatting for a specific country.",
      "tags": [
        "News"
      ],
      "goal": "Fetch the top 10 current news headlines from Google News for the '{{ variables['Country'] }}' region. Analyze and categorize the headlines by topic (Politics, Business, Technology, Health, Sports, etc.). Create a professional news briefing document that includes: 1) Executive summary of key trends, 2) Detailed breakdown of each headline with source and timestamp, 3) Regional impact analysis, and 4) Key takeaways for the day. Format this comprehensive briefing into a well-structured email with the subject 'Daily News Intelligence Briefing - {{ variables['Country'] }}' and send it to me.",
      "variable_names": [
        "Country"
      ],
      "required_app_names": [
        "GOOGLE_NEWS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Comprehensive Stock Analysis Report",
      "description": "Generates an institutional-grade investment research report with comprehensive financial, technical, and sentiment analysis for informed decision-making.",
      "tags": [
        "Finance"
      ],
      "goal": "For the stock ticker '{{ variables['Stock Ticker'] }}', create a comprehensive institutional-grade investment research report. SECTION 1 - Company Overview: Retrieve detailed company information including business description, sector analysis, market capitalization, employee count, and key executives. SECTION 2 - Financial Analysis: Gather fundamental metrics including P/E ratio, revenue growth, profit margins, debt-to-equity ratio, and quarterly earnings trends. SECTION 3 - Technical Analysis: Fetch 2-year historical price data, calculate moving averages (50-day, 200-day), identify support/resistance levels, and analyze volume patterns. SECTION 4 - Market Sentiment: Collect the latest 20 news articles about the company, perform sentiment analysis, and identify key themes affecting stock performance. SECTION 5 - Search Trends: Analyze Google search interest over the past 12 months to gauge public interest and correlation with stock movements. SECTION 6 - Investment Thesis: Synthesize all data into actionable insights including risk assessment, growth prospects, competitive positioning, and recommendation framework. Format this as a professional PDF report with charts, graphs, and executive summary suitable for investment decision-making.",
      "variable_names": [
        "Stock Ticker"
      ],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_TRENDS"
      ],
      "is_deep": false
    },
    {
      "name": "Domain DNS Report",
      "description": "Performs a comprehensive DNS security audit with vulnerability assessment, compliance checking, and professional reporting.",
      "tags": [
        "Utilities"
      ],
      "goal": "Perform a comprehensive DNS security audit for the domain '{{ variables['Domain Name'] }}'. Conduct multiple DNS record lookups including A, AAAA, MX, TXT, NS, CNAME, and SOA records. Analyze the results for security vulnerabilities, misconfigurations, and best practices compliance. Check for SPF, DKIM, and DMARC email authentication records. Verify SSL certificate status and expiration dates. Assess subdomain enumeration and potential exposure risks. Compile findings into a professional cybersecurity assessment report with risk ratings, remediation recommendations, and compliance status. Send the detailed DNS Security Audit Report via email with the subject 'Professional DNS Security Assessment - {{ variables['Domain Name'] }}'.",
      "variable_names": [
        "Domain Name"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Wikipedia Article to DOCX",
      "description": "Creates a comprehensive multi-page research report from Wikipedia content with professional formatting, cross-references, and detailed analysis.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive research document for the topic '{{ variables['Topic'] }}' using Wikipedia as the primary source. PHASE 1 - Data Collection: Retrieve the full Wikipedia article content, including main sections, subsections, references, and related articles. Extract key facts, dates, statistics, and notable information. PHASE 2 - Content Enhancement: Expand the summary by researching related Wikipedia pages and cross-referencing information to provide context and depth. Include historical background, current relevance, key figures, and significant developments. PHASE 3 - Document Creation: Structure the content into a professional Microsoft Word document with the following sections: Executive Summary, Detailed Overview, Historical Context, Key Facts & Statistics, Notable Figures/Events, Current Relevance, References, and Further Reading. PHASE 4 - Formatting: Apply professional formatting including proper headings, bullet points, tables for data, and consistent styling. The document should be 3-5 pages long with comprehensive coverage. Save as '{{ variables['Topic'] }}_Comprehensive_Research_Report.docx'.",
      "variable_names": [
        "Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Market Summary Report",
      "description": "Creates a comprehensive daily financial market overview with stock performance, news analysis, and trend insights.",
      "tags": [
        "Finance"
      ],
      "goal": "Generate a comprehensive daily market summary report for today. PHASE 1 - Market Overview: Retrieve current market indices performance (S&P 500, NASDAQ, Dow Jones) and major stock movements. PHASE 2 - Top Movers: Identify and analyze the biggest gainers and losers of the day with percentage changes. PHASE 3 - News Analysis: Collect top financial news stories and analyze their potential market impact. PHASE 4 - Professional Report: Create a formatted document with market summary, key insights, and outlook. PHASE 5 - Distribution: Send the daily market report with subject 'Daily Market Intelligence Report - [Current Date]'.",
      "variable_names": [],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_NEWS",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "YouTube Content Research Report",
      "description": "Researches YouTube content trends and competitor analysis for content strategy planning.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive YouTube content research report for the topic '{{ variables['Content Topic'] }}'. PHASE 1 - Trending Content: Search for top-performing videos related to your topic and analyze their titles, descriptions, and view counts. PHASE 2 - Competitor Analysis: Identify popular channels in your niche and analyze their recent content strategies. PHASE 3 - Content Gaps: Discover underserved topics and content opportunities in your field. PHASE 4 - Trend Analysis: Examine video categories and identify what types of content perform best. PHASE 5 - Strategic Recommendations: Compile insights into actionable content strategy recommendations. PHASE 6 - Report Delivery: Create a formatted research document and send it with subject 'YouTube Content Strategy Report - {{ variables['Content Topic'] }}'.",
      "variable_names": [
        "Content Topic"
      ],
      "required_app_names": [
        "YOUTUBE",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Weekly GitHub Activity Summary",
      "description": "Tracks your GitHub activity and creates a weekly productivity summary with project insights.",
      "tags": [
        "Development"
      ],
      "goal": "Generate a weekly GitHub activity summary for your authenticated account. PHASE 1 - Activity Analysis: Retrieve commits, pull requests, and issues created/resolved during the week. PHASE 2 - Repository Overview: Analyze contributions across different repositories and programming languages used. PHASE 3 - Productivity Metrics: Calculate coding frequency, project diversity, and collaboration patterns. PHASE 4 - Skill Tracking: Identify new technologies or languages explored during the week. PHASE 5 - Goal Progress: Compare current week's activity with previous weeks to track productivity trends. PHASE 6 - Weekly Report: Create a formatted summary document and send it with subject 'Weekly GitHub Activity Summary - Your Account'.",
      "variable_names": [],
      "required_app_names": [
        "GITHUB",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Event Planning Assistant",
      "description": "Creates calendar events with automated invitations and planning documentation.",
      "tags": [
        "Utilities"
      ],
      "goal": "Create a comprehensive event planning workflow for '{{ variables['Event Name'] }}' at {{ variables['Event Location'] }}'. PHASE 1 - Calendar Event: Create a Google Calendar event with the specified name and location (user will specify date/time during event creation). PHASE 2 - Attendee Management: Add attendees from the provided email list with automatic invitation sending. PHASE 3 - Event Documentation: Generate an agenda template and planning checklist document. PHASE 4 - Confirmation: Send a planning confirmation summary with event details and next steps.",
      "variable_names": [
        "Event Name",
        "Event Location"
      ],
      "required_app_names": [
        "GOOGLE_CALENDAR",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Topic Research Compilation",
      "description": "Researches any topic across multiple sources and creates a comprehensive research document with citations.",
      "tags": [
        "Research"
      ],
      "goal": "Conduct comprehensive research on '{{ variables['Research Topic'] }}' and compile findings into a professional document. PHASE 1 - Wikipedia Research: Gather detailed information from Wikipedia including historical context, key facts, and current relevance. PHASE 2 - News Analysis: Collect recent news articles and developments related to the topic. PHASE 3 - Document Creation: Structure all findings into a comprehensive research report with sections for overview, current developments, and key insights. PHASE 4 - Delivery: Send the research compilation with subject 'Research Report: {{ variables['Research Topic'] }}'.",
      "variable_names": [
        "Research Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "GOOGLE_NEWS",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    }
  ]
}
