{
  "templates": [
    {
      "name": "Get Top News Headlines",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/top_headlines.png?raw=true",
      "description": "Generates a comprehensive daily news intelligence briefing with analysis, categorization, and professional formatting for a specific country.",
      "tags": [
        "News"
      ],
      "goal": "Fetch the top 10 current news headlines from Google News for the '{{ variables['Country'] }}' region. Analyze and categorize the headlines by topic (Politics, Business, Technology, Health, Sports, etc.). Create a professional news briefing document that includes: 1) Executive summary of key trends, 2) Detailed breakdown of each headline with source and timestamp, 3) Regional impact analysis, and 4) Key takeaways for the day. Format this comprehensive briefing into a well-structured email with the subject 'Daily News Intelligence Briefing - {{ variables['Country'] }}' and send it to me via email.",
      "variable_names": [
        "Country"
      ],
      "required_app_names": [
        "GOOGLE_NEWS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Comprehensive Stock Analysis Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/stock_report.jpeg?raw=true",
      "description": "Generates an institutional-grade investment research report with comprehensive financial, technical, and sentiment analysis for informed decision-making.",
      "tags": [
        "Finance"
      ],
      "goal": "For the stock ticker '{{ variables['Stock Ticker'] }}', create a comprehensive institutional-grade investment research report. SECTION 1 - Company Overview: Retrieve detailed company information including business description, sector analysis, market capitalization, employee count, and key executives. SECTION 2 - Financial Analysis: Gather fundamental metrics including P/E ratio, revenue growth, profit margins, debt-to-equity ratio, and quarterly earnings trends. SECTION 3 - Technical Analysis: Fetch 2-year historical price data, calculate moving averages (50-day, 200-day), identify support/resistance levels, and analyze volume patterns. SECTION 4 - Market Sentiment: Collect the latest 20 news articles about the company, perform sentiment analysis, and identify key themes affecting stock performance. SECTION 5 - Search Trends: Analyze Google search interest over the past 12 months to gauge public interest and correlation with stock movements. SECTION 6 - Investment Thesis: Synthesize all data into actionable insights including risk assessment, growth prospects, competitive positioning, and recommendation framework. Format this as a professional PDF report with charts, graphs, and executive summary suitable for investment decision-making.",
      "variable_names": [
        "Stock Ticker"
      ],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_TRENDS",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Domain DNS Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/dns_report.jpeg?raw=true",
      "description": "Performs a comprehensive DNS security audit with vulnerability assessment, compliance checking, and professional reporting.",
      "tags": [
        "Security"
      ],
      "goal": "Perform a comprehensive DNS security audit for the domain '{{ variables['Domain Name'] }}'. Conduct multiple DNS record lookups including A, AAAA, MX, TXT, NS, CNAME, and SOA records. Analyze the results for security vulnerabilities, misconfigurations, and best practices compliance. Check for SPF, DKIM, and DMARC email authentication records. Verify SSL certificate status and expiration dates. Assess subdomain enumeration and potential exposure risks. Compile findings into a professional cybersecurity assessment report with risk ratings, remediation recommendations, and compliance status. Send the detailed DNS Security Audit Report via email with the subject 'Professional DNS Security Assessment - {{ variables['Domain Name'] }}'.",
      "variable_names": [
        "Domain Name"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "DOCX_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Wikipedia Article to DOCX",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/wikipedia_summary.jpeg?raw=true",
      "description": "Creates a comprehensive multi-page research report from Wikipedia content with professional formatting, cross-references, and detailed analysis.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive research document for the topic '{{ variables['Topic'] }}' using Wikipedia as the primary source. PHASE 1 - Data Collection: Retrieve the full Wikipedia article content, including main sections, subsections, references, and related articles. Extract key facts, dates, statistics, and notable information. PHASE 2 - Content Enhancement: Expand the summary by researching related Wikipedia pages and cross-referencing information to provide context and depth. Include historical background, current relevance, key figures, and significant developments. PHASE 3 - Document Creation: Structure the content into a professional Microsoft Word document with the following sections: Executive Summary, Detailed Overview, Historical Context, Key Facts & Statistics, Notable Figures/Events, Current Relevance, References, and Further Reading. PHASE 4 - Formatting: Apply professional formatting including proper headings, bullet points, tables for data, and consistent styling. The document should be 3-5 pages long with comprehensive coverage. Save as '{{ variables['Topic'] }}_Comprehensive_Research_Report.docx'. Notify me using push notification when the document is ready.",
      "variable_names": [
        "Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Market Summary Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/market_summary.jpeg?raw=true",
      "description": "Creates a comprehensive daily financial market overview with stock performance, news analysis, and trend insights.",
      "tags": [
        "Finance"
      ],
      "goal": "Generate a comprehensive daily market summary report for today. PHASE 1 - Market Overview: Retrieve current market indices performance (S&P 500, NASDAQ, Dow Jones) and major stock movements. PHASE 2 - Top Movers: Identify and analyze the biggest gainers and losers of the day with percentage changes. PHASE 3 - News Analysis: Collect top financial news stories and analyze their potential market impact. PHASE 4 - Professional Report: Create a formatted document with market summary, key insights, and outlook. PHASE 5 - Distribution: Send the daily market report with subject 'Daily Market Intelligence Report - [Current Date]'.",
      "variable_names": [],
      "required_app_names": [
        "YAHOO_FINANCE",
        "GOOGLE_NEWS",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    },
    {
      "name": "Topic Research Compilation",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/topic_research.jpeg?raw=true",
      "description": "Researches any topic across multiple sources and creates a comprehensive research document with citations.",
      "tags": [
        "Research"
      ],
      "goal": "Conduct comprehensive research on '{{ variables['Research Topic'] }}' and compile findings into a professional document. PHASE 1 - Wikipedia Research: Gather detailed information from Wikipedia including historical context, key facts, and current relevance. PHASE 2 - News Analysis: Collect recent news articles and developments related to the topic. PHASE 3 - Document Creation: Structure all findings into a comprehensive research report with sections for overview, current developments, and key insights. PHASE 4 - Delivery: Send the research compilation with subject 'Research Report: {{ variables['Research Topic'] }}'.",
      "variable_names": [
        "Research Topic"
      ],
      "required_app_names": [
        "WIKIPEDIA_API",
        "GOOGLE_NEWS",
        "DOCX_TOOLS",
        "SEARXNG"
      ],
      "is_deep": true
    },
    {
      "name": "Survey Creation & Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/survey_creation.png?raw=true",
      "description": "Creates professional surveys and sets them up for data collection with sharing information.",
      "tags": [
        "Surveys"
      ],
      "goal": "Create a professional survey for '{{ variables['Survey Topic'] }}' and prepare it for distribution. STEP 1 - Create Survey: Use TYPEFORM__CREATE_FORM to create a new form with title 'Survey: {{ variables['Survey Topic'] }}'. STEP 2 - Add Questions: Use TYPEFORM__UPDATE_FORM_STRUCTURE to add 5-7 relevant questions including: 1) multiple_choice question about main topic areas, 2) rating question (1-10 scale) for satisfaction/agreement, 3) short_text question for specific feedback, 4) long_text question for detailed comments, 5) yes_no question for follow-up interest. STEP 3 - Prepare Distribution: Use TYPEFORM__LIST_FORMS to get the form details and sharing URL. STEP 4 - Send Setup Confirmation: Use NOTIFYME to send survey creation confirmation with form URL, question summary, and instructions for sharing with target audience.",
      "variable_names": [
        "Survey Topic"
      ],
      "required_app_names": [
        "TYPEFORM"
      ],
      "is_deep": false
    },
    {
      "name": "Water Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/water_reminder.jpeg?raw=true",
      "description": "Sends a friendly reminder to drink water and stay hydrated.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a hydration reminder via mobile push notification: 'Time to hydrate! ðŸ’§ Drink a glass of water to stay healthy and energized. Your body needs regular hydration to function at its best.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with an encouraging message about hydration benefits.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Take a Break Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/take_a_break.jpeg?raw=true",
      "description": "Reminds you to take a break from work or screen time for better productivity.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send an encouraging break reminder via mobile push notification: 'Time for a quick break! ðŸ§˜ Stand up, stretch, or step away from your screen for 5 minutes. Taking regular breaks helps maintain focus and prevents eye strain.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with suggestions for break activities.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Gratitude Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/daily_gratitude.jpeg?raw=true",
      "description": "Sends a daily prompt to practice gratitude and positive thinking.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a gratitude reminder via mobile push notification: 'What are you grateful for today? âœ¨ Take a moment to appreciate three good things that happened. Practicing gratitude helps improve mental wellness and cultivate a positive mindset.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with mindfulness prompts.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Exercise Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/excersise_reminder.jpeg?raw=true",
      "description": "Motivational reminder to stay active and maintain fitness goals.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a motivational fitness reminder via mobile push notification: 'Time to move your body! ðŸ’ª Even 10 minutes of activity makes a difference. Whether it's a quick walk, some stretches, or a full workout, your body will thank you.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with encouraging fitness motivation.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Medication Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/medication_reminder.jpeg?raw=true",
      "description": "Important health reminder to take medication or supplements.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a critical medication reminder via mobile push notification for '{{ variables['Medication Name'] }}': 'âš•ï¸ MEDICATION REMINDER: Time to take your {{ variables['Medication Name'] }}. Don't skip your dose! Consistent medication adherence is important for your health.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION for immediate attention.",
      "variable_names": [
        "Medication Name"
      ],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily Goal Check-in",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/productivity_goal.jpeg?raw=true",
      "description": "Prompt to review progress on daily goals and tasks.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a goal check-in prompt via mobile push notification: 'How are your goals coming along today? ðŸŽ¯ Take a moment to review your progress and plan your next steps. Small daily actions lead to big achievements!' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with motivational productivity messages.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Posture Check Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/posture_check.jpeg?raw=true",
      "description": "Reminder to maintain good posture while working or sitting.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a posture awareness reminder via mobile push notification: 'Posture check! ðŸª‘ Sit up straight, relax your shoulders, and adjust your screen height. Good posture prevents back pain and helps you stay comfortable during work.' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with ergonomic health tips.",
      "variable_names": [],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Custom Reminder",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/custom_reminder.jpeg?raw=true",
      "description": "Creates a personalized reminder for anything you want to remember.",
      "tags": [
        "Reminders"
      ],
      "goal": "Send a custom reminder about '{{ variables['Reminder Topic'] }}' via mobile push notification with the message: '{{ variables['Reminder Message'] }}' Use NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with the custom title and message, including encouraging words and relevant tips for consistency.",
      "variable_names": [
        "Reminder Topic",
        "Reminder Message"
      ],
      "required_app_names": [
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Weekly Team Progress Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/jira_team_report.jpeg?raw=true",
      "description": "Generates a comprehensive weekly team progress report from JIRA with project status, issue summaries, and team performance insights.",
      "tags": [
        "Productivity"
      ],
      "goal": "Generate a comprehensive weekly team progress report from JIRA for '{{ variables['Project Key'] }}'. STEP 1 - Setup: Use JIRA__GET_ACCESSIBLE_RESOURCES to get the cloud ID, then JIRA__GET_PROJECTS to verify project access. STEP 2 - Collect Data: Use JIRA__SEARCH_ISSUES with JQL queries to gather: a) Issues completed this week (status changed to Done), b) Issues currently in progress, c) High priority issues, d) Issues assigned to each team member. STEP 3 - Analyze Metrics: Calculate completion rates, identify blockers, track sprint progress, and summarize team workload distribution. STEP 4 - Generate Report: Create a structured document with executive summary, team achievements, current focus areas, upcoming deadlines, and key metrics. STEP 5 - Distribute: Send via email with subject 'Weekly Team Progress Report - {{ variables['Project Key'] }} - [Current Date]' including charts and actionable insights for stakeholders.",
      "variable_names": [
        "Project Key"
      ],
      "required_app_names": [
        "JIRA",
        "DOCX_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Website Monitor & Alert",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/website_monitor.jpeg?raw=true",
      "description": "Monitors website availability and performance with instant alerts when issues are detected.",
      "tags": [
        "Monitoring"
      ],
      "goal": "Monitor the website '{{ variables['Website URL'] }}' for availability and performance issues. Use IP_TOOLS functions to perform regular health checks including: 1) HTTP response status verification, 2) Response time measurement, 3) SSL certificate validation, 4) DNS resolution checks. If any issues are detected (site down, slow response >5 seconds, SSL expiring within 30 days), immediately send alert via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with specific details about the problem and recommended actions for quick resolution.",
      "variable_names": [
        "Website URL"
      ],
      "required_app_names": [
        "IP_TOOLS",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "Daily arXiv Research Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/arxiv_digest.jpeg?raw=true",
      "description": "Curates and delivers a personalized daily digest of the latest research papers from arXiv based on your interests.",
      "tags": [
        "Research"
      ],
      "goal": "Create a comprehensive daily arXiv research digest for '{{ variables['Research Field'] }}'. STEP 1 - Paper Collection: Use ARXIV to search for the latest papers in {{ variables['Research Field'] }} published in the last 24 hours, focusing on high-impact research with relevance scoring. STEP 2 - Content Analysis: For each paper, extract key information including title, authors, abstract summary, methodology highlights, and potential impact. Identify breakthrough findings, novel approaches, and significant contributions. STEP 3 - Digest Creation: Structure findings into a professional HTML email briefing with sections for: Featured Papers (top 3 most significant), Emerging Trends, Methodological Innovations, and Quick Reads (papers under 10 pages). STEP 4 - Intelligence Report: Format as a comprehensive email with paper summaries, author insights, citation potential, and relevance to current research landscape. STEP 5 - Delivery: Send the arXiv Research Digest via NOTIFYME__SEND_ME_EMAIL with subject 'Daily arXiv Research Digest - {{ variables['Research Field'] }} - [Current Date]' including direct links to papers and reading recommendations in a well-formatted HTML email.",
      "variable_names": [
        "Research Field"
      ],
      "required_app_names": [
        "ARXIV",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Hacker News Digest",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/hackernews_digest.jpeg?raw=true",
      "description": "Delivers a curated daily summary of top stories, discussions, and tech trends from Hacker News with community insights.",
      "tags": [
        "News"
      ],
      "goal": "Generate a comprehensive daily Hacker News digest with the most engaging tech stories and discussions. STEP 1 - Story Collection: Use HACKERNEWS to fetch today's top stories, trending discussions, and highly-commented posts. Focus on stories with high engagement (upvotes + comments) and tech relevance. STEP 2 - Content Categorization: Organize stories into categories: Startup News, Technology Trends, Programming & Development, AI/ML Updates, Open Source Projects, Industry Analysis, and Community Discussions. STEP 3 - Engagement Analysis: For each top story, include upvote count, comment highlights, and community sentiment. Identify controversial topics and emerging debates. STEP 4 - Trend Identification: Analyze recurring themes, popular technologies mentioned, and emerging patterns in the tech community discourse. STEP 5 - Email Digest: Format as a comprehensive HTML email with executive summary of key tech trends, detailed story breakdowns with community insights, notable comments from experts, and clickable links for deeper reading. STEP 6 - Distribution: Send the Hacker News Tech Digest via NOTIFYME__SEND_ME_EMAIL with subject 'Daily Hacker News Tech Digest - [Current Date]' including story links and community discussion highlights in a well-structured HTML email format.",
      "variable_names": [],
      "required_app_names": [
        "HACKERNEWS",
        "NOTIFYME"
      ],
      "is_deep": true
    },
    {
      "name": "Daily Joke Notification",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/daily_joke.jpeg?raw=true",
      "description": "Brightens your day with a funny joke delivered via mobile push notification.",
      "tags": [
        "Entertainment"
      ],
      "goal": "Fetch a random joke from JOKES_API and deliver it via mobile push notification to brighten the user's day. Use JOKES_API to get a clean, family-friendly joke (avoiding offensive categories). Format the notification with the joke setup and punchline in an engaging way. Send via NOTIFYME__SEND_ME_MOBILE_NOTIFICATION with title 'Daily Joke ðŸ˜„' and the joke content formatted with emojis and clear setup/punchline structure for maximum entertainment value.",
      "variable_names": [],
      "required_app_names": [
        "JOKE_API",
        "NOTIFYME"
      ],
      "is_deep": false
    },
    {
      "name": "URL to PDF Converter",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/url_to_pdf.png?raw=true",
      "description": "Converts any web page or article to a clean, formatted PDF document for offline reading and archiving.",
      "tags": [
        "Productivity"
      ],
      "goal": "Convert the webpage at '{{ variables['Website URL'] }}' to PDF using PDF_TOOLS.",
      "variable_names": [
        "Website URL"
      ],
      "required_app_names": [
        "PDF_TOOLS"
      ],
      "is_deep": false
    },
    {
      "name": "Work Schedule Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/work_schedule.jpeg?raw=true",
      "description": "Creates a professional work schedule in Cal.com with specified working hours and timezone for optimal meeting booking.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create work schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for Monday through Friday from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone", 
        "Start Time",
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Weekend Availability Setup",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/weekend_schedule.jpeg?raw=true",
      "description": "Sets up weekend availability in Cal.com for flexible meeting scheduling outside regular business hours.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create weekend schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for Saturday and Sunday from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone",
        "Start Time", 
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Schedule Overview Report",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/schedule_report.jpeg?raw=true",
      "description": "Generates a comprehensive report of all your Cal.com schedules with availability details and settings.",
      "tags": [
        "Productivity"
      ],
      "goal": "Generate schedule overview report using CAL__GET_SCHEDULES to retrieve all schedules, then create professional summary document with DOCX_TOOLS showing schedule details and availability patterns.",
      "variable_names": [],
      "required_app_names": [
        "CAL",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    },
    {
      "name": "Custom Schedule Creator",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/custom_schedule.jpeg?raw=true",
      "description": "Creates a fully customized schedule in Cal.com with specific days, hours, and availability patterns tailored to your needs.",
      "tags": [
        "Productivity"
      ],
      "goal": "Create custom schedule using CAL__CREATE_SCHEDULE with name '{{ variables['Schedule Name'] }}', timezone '{{ variables['Timezone'] }}', and availability for {{ variables['Available Days'] }} from {{ variables['Start Time'] }} to {{ variables['End Time'] }}.",
      "variable_names": [
        "Schedule Name",
        "Timezone",
        "Available Days",
        "Start Time",
        "End Time"
      ],
      "required_app_names": [
        "CAL"
      ],
      "is_deep": false
    },
    {
      "name": "Schedule Backup & Documentation",
      "banner_image_url": "https://github.com/abdulzain6/autom8-logos/blob/master/automation_banners/schedule_backup.jpeg?raw=true", 
      "description": "Creates a comprehensive backup and documentation of all your Cal.com schedules for safekeeping and reference.",
      "tags": [
        "Productivity"
      ],
      "goal": "Backup all Cal.com schedules using CAL__GET_SCHEDULES to retrieve schedule data, then create detailed backup document with DOCX_TOOLS containing all schedule configurations and settings.",
      "variable_names": [],
      "required_app_names": [
        "CAL",
        "DOCX_TOOLS"
      ],
      "is_deep": true
    }
  ]
}
